Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_spi.h
#define SPI_CSR_CPOL_Pos            0            /**< \brief (SPI_CSR) Clock Polarity */
#define SPI_CSR_CPOL                (0x1u << SPI_CSR_CPOL_Pos)
#define   SPI_CSR_CPOL_0            (0x0u <<  0) /**< \brief (SPI_CSR) The inactive state value of SPCK is logic level zero. */
#define   SPI_CSR_CPOL_1            (0x1u <<  0) /**< \brief (SPI_CSR) The inactive state value of SPCK is logic level one.CPOL is used to determine the inactive state value of the serial clock (SPCK). It is used with NCPHA to produce therequired clock/data relationship between master and slave devices. */
#define SPI_CSR_NCPHA_Pos           1            /**< \brief (SPI_CSR) Clock Phase */
#define SPI_CSR_NCPHA               (0x1u << SPI_CSR_NCPHA_Pos)
#define   SPI_CSR_NCPHA_0           (0x0u <<  1) /**< \brief (SPI_CSR) Data is changed on the leading edge of SPCK and captured on the following edge of SPCK. */
#define   SPI_CSR_NCPHA_1           (0x1u <<  1) /**< \brief (SPI_CSR) Data is captured on the leading edge of SPCK and changed on the following edge of SPCK.NCPHA determines which edge of SPCK causes data to change and which edge causes data to be captured. NCPHA isused with CPOL to produce the required clock/data relationship between master and slave devices. */
#define SPI_CSR_CSNAAT_Pos          2            /**< \brief (SPI_CSR) Chip Select Not Active After Transfer */
#define SPI_CSR_CSNAAT              (0x1u << SPI_CSR_CSNAAT_Pos)
#define SPI_CSR_CSAAT_Pos           3            /**< \brief (SPI_CSR) Chip Select Active After Transfer */
#define SPI_CSR_CSAAT               (0x1u << SPI_CSR_CSAAT_Pos)
#define   SPI_CSR_CSAAT_0           (0x0u <<  3) /**< \brief (SPI_CSR) The Peripheral Chip Select Line rises as soon as the last transfer is achieved. */
#define   SPI_CSR_CSAAT_1           (0x1u <<  3) /**< \brief (SPI_CSR) The Peripheral Chip Select does not rise after the last transfer is achieved. It remains active until a new transfer isrequested on a different chip select. */
#define SPI_CSR_BITS_Pos            4            /**< \brief (SPI_CSR) Bits Per Transfer */
#define SPI_CSR_BITS_Msk            (0xFu << SPI_CSR_BITS_Pos)
#define SPI_CSR_BITS(value)         ((SPI_CSR_BITS_Msk & ((value) << SPI_CSR_BITS_Pos)))
#define   SPI_CSR_BITS_8_BPT        (0x0u <<  4) /**< \brief (SPI_CSR) 8 bits per transfer */
#define   SPI_CSR_BITS_9_BPT        (0x1u <<  4) /**< \brief (SPI_CSR) 9 bits per transfer */
#define   SPI_CSR_BITS_10_BPT       (0x2u <<  4) /**< \brief (SPI_CSR) 10 bits per transfer */
#define   SPI_CSR_BITS_11_BPT       (0x3u <<  4) /**< \brief (SPI_CSR) 11 bits per transfer */
#define   SPI_CSR_BITS_12_BPT       (0x4u <<  4) /**< \brief (SPI_CSR) 12 bits per transfer */
#define   SPI_CSR_BITS_13_BPT       (0x5u <<  4) /**< \brief (SPI_CSR) 13 bits per transfer */
#define   SPI_CSR_BITS_14_BPT       (0x6u <<  4) /**< \brief (SPI_CSR) 14 bits per transfer */
#define   SPI_CSR_BITS_15_BPT       (0x7u <<  4) /**< \brief (SPI_CSR) 15 bits per transfer */
#define   SPI_CSR_BITS_16_BPT       (0x8u <<  4) /**< \brief (SPI_CSR) 16 bits per transfer */
#define SPI_CSR_SCBR_Pos            8            /**< \brief (SPI_CSR) Serial Clock Baud Rate */
#define SPI_CSR_SCBR_Msk            (0xFFu << SPI_CSR_SCBR_Pos)
#define SPI_CSR_SCBR(value)         ((SPI_CSR_SCBR_Msk & ((value) << SPI_CSR_SCBR_Pos)))
#define SPI_CSR_DLYBS_Pos           16           /**< \brief (SPI_CSR) Delay Before SPCK */
#define SPI_CSR_DLYBS_Msk           (0xFFu << SPI_CSR_DLYBS_Pos)
#define SPI_CSR_DLYBS(value)        ((SPI_CSR_DLYBS_Msk & ((value) << SPI_CSR_DLYBS_Pos)))
#define SPI_CSR_DLYBCT_Pos          24           /**< \brief (SPI_CSR) Delay Between Consecutive Transfers */
#define SPI_CSR_DLYBCT_Msk          (0xFFu << SPI_CSR_DLYBCT_Pos)
#define SPI_CSR_DLYBCT(value)       ((SPI_CSR_DLYBCT_Msk & ((value) << SPI_CSR_DLYBCT_Pos)))
#define SPI_CSR_MASK                0xFFFFFFFFu  /**< \brief (SPI_CSR) MASK Register */

/* -------- SPI_WPCR : (SPI Offset: 0xE4) (R/W 32) Write Protection control Register -------- */
#define SPI_WPCR_OFFSET             0xE4         /**< \brief (SPI_WPCR offset) Write Protection control Register */
#define SPI_WPCR_RESETVALUE         0x00000000   /**< \brief (SPI_WPCR reset_value) Write Protection control Register */

#define SPI_WPCR_WPEN_Pos           0            /**< \brief (SPI_WPCR) Write Protection Enable */
#define SPI_WPCR_WPEN               (0x1u << SPI_WPCR_WPEN_Pos)
#define SPI_WPCR_WPKEY_Pos          8            /**< \brief (SPI_WPCR) Write Protection Key Password */
#define SPI_WPCR_WPKEY_Msk          (0xFFFFFFu << SPI_WPCR_WPKEY_Pos)
#define SPI_WPCR_WPKEY(value)       ((SPI_WPCR_WPKEY_Msk & ((value) << SPI_WPCR_WPKEY_Pos)))
#define   SPI_WPCR_WPKEY_VALUE      (0x535049u <<  8) /**< \brief (SPI_WPCR) SPI Write Protection Key Password */
#define SPI_WPCR_MASK               0xFFFFFF01u  /**< \brief (SPI_WPCR) MASK Register */

/* -------- SPI_WPSR : (SPI Offset: 0xE8) (R/  32) Write Protection status Register -------- */
#define SPI_WPSR_OFFSET             0xE8         /**< \brief (SPI_WPSR offset) Write Protection status Register */
#define SPI_WPSR_RESETVALUE         0x00000000   /**< \brief (SPI_WPSR reset_value) Write Protection status Register */

#define SPI_WPSR_WPVS_Pos           0            /**< \brief (SPI_WPSR) Write Protection Violation Status */
#define SPI_WPSR_WPVS_Msk           (0x7u << SPI_WPSR_WPVS_Pos)
#define SPI_WPSR_WPVS(value)        ((SPI_WPSR_WPVS_Msk & ((value) << SPI_WPSR_WPVS_Pos)))
#define   SPI_WPSR_WPVS_WRITE_WITH_WP (0x1u <<  0) /**< \brief (SPI_WPSR) The Write Protection has blocked a Write access to a protected register (since the last read). */
#define   SPI_WPSR_WPVS_SWRST_WITH_WP (0x2u <<  0) /**< \brief (SPI_WPSR) Software Reset has been performed while Write Protection was enabled (since the last read or since the last write access on MR, IER, IDR or CSRx). */
#define   SPI_WPSR_WPVS_UNEXPECTED_WRITE (0x4u <<  0) /**< \brief (SPI_WPSR) Write accesses have been detected on MR (while a chip select was active) or on CSRi (while the Chip Select "i" was active) since the last read. */
#define SPI_WPSR_WPVSRC_Pos         8            /**< \brief (SPI_WPSR) Write Protection Violation Source */
#define SPI_WPSR_WPVSRC_Msk         (0xFFu << SPI_WPSR_WPVSRC_Pos)
#define SPI_WPSR_WPVSRC(value)      ((SPI_WPSR_WPVSRC_Msk & ((value) << SPI_WPSR_WPVSRC_Pos)))
#define SPI_WPSR_MASK               0x0000FF07u  /**< \brief (SPI_WPSR) MASK Register */

/* -------- SPI_FEATURES : (SPI Offset: 0xF8) (R/  32) Features Register -------- */
#define SPI_FEATURES_OFFSET         0xF8         /**< \brief (SPI_FEATURES offset) Features Register */

#define SPI_FEATURES_NCS_Pos        0            /**< \brief (SPI_FEATURES) Number of Chip Selects */
#define SPI_FEATURES_NCS_Msk        (0xFu << SPI_FEATURES_NCS_Pos)
#define SPI_FEATURES_NCS(value)     ((SPI_FEATURES_NCS_Msk & ((value) << SPI_FEATURES_NCS_Pos)))
#define SPI_FEATURES_PCONF_Pos      4            /**< \brief (SPI_FEATURES) Polarity is Configurable */
#define SPI_FEATURES_PCONF          (0x1u << SPI_FEATURES_PCONF_Pos)
#define SPI_FEATURES_PPNCONF_Pos    5            /**< \brief (SPI_FEATURES) Polarity is Positive if Polarity is not Configurable */
#define SPI_FEATURES_PPNCONF        (0x1u << SPI_FEATURES_PPNCONF_Pos)
#define SPI_FEATURES_PHCONF_Pos     6            /**< \brief (SPI_FEATURES) Phase is Configurable */
#define SPI_FEATURES_PHCONF         (0x1u << SPI_FEATURES_PHCONF_Pos)
#define SPI_FEATURES_PHZNCONF_Pos   7            /**< \brief (SPI_FEATURES) Phase is Zero if Phase is not Configurable */
#define SPI_FEATURES_PHZNCONF       (0x1u << SPI_FEATURES_PHZNCONF_Pos)
#define SPI_FEATURES_LENCONF_Pos    8            /**< \brief (SPI_FEATURES) Character Length is Configurable */
#define SPI_FEATURES_LENCONF        (0x1u << SPI_FEATURES_LENCONF_Pos)
#define SPI_FEATURES_LENNCONF_Pos   9            /**< \brief (SPI_FEATURES) Character Length if not Configurable */
#define SPI_FEATURES_LENNCONF_Msk   (0x7Fu << SPI_FEATURES_LENNCONF_Pos)
#define SPI_FEATURES_LENNCONF(value) ((SPI_FEATURES_LENNCONF_Msk & ((value) << SPI_FEATURES_LENNCONF_Pos)))
#define SPI_FEATURES_EXTDEC_Pos     16           /**< \brief (SPI_FEATURES) External Decoder is True */
#define SPI_FEATURES_EXTDEC         (0x1u << SPI_FEATURES_EXTDEC_Pos)
#define SPI_FEATURES_CSNAATIMPL_Pos 17           /**< \brief (SPI_FEATURES) CSNAAT Features are Implemented */
#define SPI_FEATURES_CSNAATIMPL     (0x1u << SPI_FEATURES_CSNAATIMPL_Pos)
#define SPI_FEATURES_BRPBHSB_Pos    18           /**< \brief (SPI_FEATURES) Bridge Type is PB to HSB */
#define SPI_FEATURES_BRPBHSB        (0x1u << SPI_FEATURES_BRPBHSB_Pos)
#define SPI_FEATURES_FIFORIMPL_Pos  19           /**< \brief (SPI_FEATURES) FIFO in Reception is Implemented */
#define SPI_FEATURES_FIFORIMPL      (0x1u << SPI_FEATURES_FIFORIMPL_Pos)
#define SPI_FEATURES_SWPIMPL_Pos    20           /**< \brief (SPI_FEATURES) Spurious Write Protection is Implemented */
#define SPI_FEATURES_SWPIMPL        (0x1u << SPI_FEATURES_SWPIMPL_Pos)
#define SPI_FEATURES_MASK           0x001FFFFFu  /**< \brief (SPI_FEATURES) MASK Register */

