Klipper3d/klipper/lib/asf/sam/utils/cmsis/sam4l/include/component/component_spi.h
/* -------- SPI_VERSION : (SPI Offset: 0xFC) (R/  32) Version Register -------- */
#define SPI_VERSION_OFFSET          0xFC         /**< \brief (SPI_VERSION offset) Version Register */
#define SPI_VERSION_RESETVALUE      0x00000211   /**< \brief (SPI_VERSION reset_value) Version Register */

#define SPI_VERSION_VERSION_Pos     0            /**< \brief (SPI_VERSION) Version */
#define SPI_VERSION_VERSION_Msk     (0xFFFu << SPI_VERSION_VERSION_Pos)
#define SPI_VERSION_VERSION(value)  ((SPI_VERSION_VERSION_Msk & ((value) << SPI_VERSION_VERSION_Pos)))
#define SPI_VERSION_MFN_Pos         16           /**< \brief (SPI_VERSION) mfn */
#define SPI_VERSION_MFN_Msk         (0x7u << SPI_VERSION_MFN_Pos)
#define SPI_VERSION_MFN(value)      ((SPI_VERSION_MFN_Msk & ((value) << SPI_VERSION_MFN_Pos)))
#define SPI_VERSION_MASK            0x00070FFFu  /**< \brief (SPI_VERSION) MASK Register */

/** \brief SPI hardware registers */
#if !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__))
typedef struct {
  WoReg   SPI_CR;             /**< \brief (SPI Offset: 0x00) Control Register */
  RwReg   SPI_MR;             /**< \brief (SPI Offset: 0x04) Mode Register */
  RoReg   SPI_RDR;            /**< \brief (SPI Offset: 0x08) Receive Data Register */
  WoReg   SPI_TDR;            /**< \brief (SPI Offset: 0x0C) Transmit Data Register */
  RoReg   SPI_SR;             /**< \brief (SPI Offset: 0x10) Status Register */
  WoReg   SPI_IER;            /**< \brief (SPI Offset: 0x14) Interrupt Enable Register */
  WoReg   SPI_IDR;            /**< \brief (SPI Offset: 0x18) Interrupt Disable Register */
  RoReg   SPI_IMR;            /**< \brief (SPI Offset: 0x1C) Interrupt Mask Register */
  RoReg8  Reserved1[0x10];
  RwReg   SPI_CSR[4];         /**< \brief (SPI Offset: 0x30) Chip Select Register */
  RoReg8  Reserved2[0xA4];
  RwReg   SPI_WPCR;           /**< \brief (SPI Offset: 0xE4) Write Protection control Register */
  RoReg   SPI_WPSR;           /**< \brief (SPI Offset: 0xE8) Write Protection status Register */
  RoReg8  Reserved3[0xC];
  RoReg   SPI_FEATURES;       /**< \brief (SPI Offset: 0xF8) Features Register */
  RoReg   SPI_VERSION;        /**< \brief (SPI Offset: 0xFC) Version Register */
} Spi;
#endif /* !(defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)) */

/*@}*/

#endif /* _SAM4L_SPI_COMPONENT_ */
